export type Line = {
    id: number;
    name: string;
    hex: string;
};

export type LatLon = [number, number];

export type Station = {
    name: string;
    latlon: LatLon;
};

export type Metro = {
    line: Line;
    stations: Array<Station>;
};

const MOSCOW: Array<Metro> = [
    {
        line: { id: 1, name: 'Сокольническая', hex: '#D92B2C' },
        stations: [
            { name: 'Бульвар Рокоссовского', latlon: [55.8154055, 37.7329261] },
            {
                name: 'Черкизовская',
                latlon: [55.803943, 37.744764]
            },
            { name: 'Преображенская площадь', latlon: [55.7962395, 37.7154778] },
            {
                name: 'Сокольники',
                latlon: [55.78925, 37.679683]
            },
            { name: 'Красносельская', latlon: [55.7799958, 37.6661449] },
            {
                name: 'Комсомольская',
                latlon: [55.7764063, 37.6561361]
            },
            { name: 'Красные ворота', latlon: [55.76908, 37.649106] },
            {
                name: 'Чистые пруды',
                latlon: [55.7649152, 37.6383605]
            },
            { name: 'Лубянка', latlon: [55.75966, 37.626581] },
            {
                name: 'Охотный ряд',
                latlon: [55.7572235, 37.6150129]
            },
            { name: 'Библиотека имени Ленина', latlon: [55.7522265, 37.6103187] },
            {
                name: 'Кропоткинская',
                latlon: [55.745155, 37.603031]
            },
            { name: 'Парк культуры', latlon: [55.7351793, 37.5931278] },
            {
                name: 'Фрунзенская',
                latlon: [55.727474, 37.580683]
            },
            { name: 'Спортивная', latlon: [55.7224328, 37.5620735] },
            {
                name: 'Воробьёвы горы',
                latlon: [55.7115933, 37.561049]
            },
            { name: 'Университет', latlon: [55.6931907, 37.5345267] },
            {
                name: 'Проспект Вернадского',
                latlon: [55.676978, 37.50631]
            },
            { name: 'Юго-Западная', latlon: [55.66375, 37.483152] },
            {
                name: 'Тропарёво',
                latlon: [55.645646, 37.4729972]
            },
            { name: 'Румянцево', latlon: [55.632969, 37.441696] },
            {
                name: 'Саларьево',
                latlon: [55.621907, 37.424165]
            }
        ]
    },
    {
        line: { id: 2, name: 'Замоскворецкая', hex: '#4DBE52' },
        stations: [
            { name: 'Алма-Атинская', latlon: [55.632813, 37.766061] },
            {
                name: 'Красногвардейская',
                latlon: [55.613866, 37.744544]
            },
            { name: 'Домодедовская', latlon: [55.610953, 37.71909] },
            {
                name: 'Орехово',
                latlon: [55.613195, 37.694966]
            },
            { name: 'Царицыно', latlon: [55.621456, 37.669453] },
            {
                name: 'Кантемировская',
                latlon: [55.6347702, 37.6570599]
            },
            { name: 'Каширская', latlon: [55.655134, 37.648843] },
            {
                name: 'Коломенская',
                latlon: [55.6795093, 37.6633652]
            },
            { name: 'Технопарк', latlon: [55.693704, 37.664496] },
            {
                name: 'Автозаводская',
                latlon: [55.7086, 37.6573453]
            },
            { name: 'Павелецкая', latlon: [55.731266, 37.636263] },
            {
                name: 'Новокузнецкая',
                latlon: [55.7424277, 37.6292832]
            },
            { name: 'Театральная', latlon: [55.7576, 37.618738] },
            {
                name: 'Тверская',
                latlon: [55.765362, 37.6049562]
            },
            { name: 'Маяковская', latlon: [55.7703912, 37.5960546] },
            {
                name: 'Белорусская',
                latlon: [55.7771985, 37.5817828]
            },
            { name: 'Динамо', latlon: [55.7891159, 37.5595953] },
            {
                name: 'Аэропорт',
                latlon: [55.800365, 37.532628]
            },
            { name: 'Сокол', latlon: [55.80478, 37.515548] },
            {
                name: 'Войковская',
                latlon: [55.819087, 37.497888]
            },
            { name: 'Водный стадион', latlon: [55.839933, 37.486703] },
            {
                name: 'Речной вокзал',
                latlon: [55.8551525, 37.4760633]
            },
            { name: 'Беломорская', latlon: [55.865369, 37.475692] },
            {
                name: 'Ховрино',
                latlon: [55.878273, 37.480768]
            }
        ]
    },
    {
        line: { id: 3, name: 'Арбатско-Покровская', hex: '#2C75C4' },
        stations: [
            { name: 'Щёлковская', latlon: [55.8084991, 37.7984928] },
            {
                name: 'Первомайская',
                latlon: [55.794507, 37.799363]
            },
            { name: 'Измайловская', latlon: [55.787775, 37.781435] },
            {
                name: 'Партизанская',
                latlon: [55.788451, 37.749619]
            },
            { name: 'Семёновская', latlon: [55.78306, 37.719423] },
            {
                name: 'Электрозаводская',
                latlon: [55.782094, 37.705287]
            },
            { name: 'Бауманская', latlon: [55.7724663, 37.679113] },
            {
                name: 'Курская',
                latlon: [55.7585098, 37.6602746]
            },
            { name: 'Площадь Революции', latlon: [55.7564497, 37.6233539] },
            {
                name: 'Арбатская',
                latlon: [55.752161, 37.601518]
            },
            { name: 'Смоленская', latlon: [55.747933, 37.5836873] },
            {
                name: 'Киевская',
                latlon: [55.7440118, 37.5673351]
            },
            { name: 'Парк Победы', latlon: [55.7358848, 37.5174924] },
            {
                name: 'Славянский бульвар',
                latlon: [55.729576, 37.470717]
            },
            { name: 'Кунцевская', latlon: [55.7306809, 37.4452868] },
            {
                name: 'Молодёжная',
                latlon: [55.740611, 37.416918]
            },
            { name: 'Крылатское', latlon: [55.756838, 37.408013] },
            {
                name: 'Строгино',
                latlon: [55.803723, 37.403083]
            },
            { name: 'Мякинино', latlon: [55.825476, 37.38537] },
            {
                name: 'Волоколамская',
                latlon: [55.835749, 37.38199]
            },
            { name: 'Митино', latlon: [55.846006, 37.361364] },
            {
                name: 'Пятницкое шоссе',
                latlon: [55.855876, 37.354181]
            }
        ]
    },
    {
        line: { id: 4, name: 'Филёвская', hex: '#4DC6F4' },
        stations: [
            { name: 'Кунцевская', latlon: [55.7306809, 37.4452868] },
            {
                name: 'Пионерская',
                latlon: [55.7361492, 37.4676943]
            },
            { name: 'Филёвский парк', latlon: [55.73957, 37.4833029] },
            {
                name: 'Багратионовская',
                latlon: [55.743792, 37.497743]
            },
            { name: 'Фили', latlon: [55.746099, 37.514797] },
            {
                name: 'Кутузовская',
                latlon: [55.740005, 37.534377]
            },
            { name: 'Студенческая', latlon: [55.738878, 37.5483398] },
            {
                name: 'Киевская',
                latlon: [55.7440118, 37.5673351]
            },
            { name: 'Смоленская', latlon: [55.747933, 37.5836873] },
            {
                name: 'Арбатская',
                latlon: [55.752161, 37.601518]
            },
            { name: 'Александровский сад', latlon: [55.752289, 37.608663] },
            {
                name: 'Выставочная',
                latlon: [55.750015, 37.542048]
            },
            { name: 'Международная', latlon: [55.747819, 37.533181] }
        ]
    },
    {
        line: { id: 5, name: 'Кольцевая', hex: '#85412E' },
        stations: [
            { name: 'Парк культуры', latlon: [55.7351793, 37.5931278] },
            {
                name: 'Октябрьская',
                latlon: [55.7292498, 37.6113133]
            },
            { name: 'Добрынинская', latlon: [55.72898, 37.622529] },
            {
                name: 'Павелецкая',
                latlon: [55.731266, 37.636263]
            },
            { name: 'Таганская', latlon: [55.7424507, 37.6533745] },
            {
                name: 'Курская',
                latlon: [55.7585098, 37.6602746]
            },
            { name: 'Комсомольская', latlon: [55.7764063, 37.6561361] },
            {
                name: 'Проспект Мира',
                latlon: [55.7797015, 37.6336099]
            },
            { name: 'Новослободская', latlon: [55.7796266, 37.6014405] },
            {
                name: 'Белорусская',
                latlon: [55.7771985, 37.5817828]
            },
            { name: 'Краснопресненская', latlon: [55.7602466, 37.5771211] },
            {
                name: 'Киевская',
                latlon: [55.7440118, 37.5673351]
            }
        ]
    },
    {
        line: { id: 6, name: 'Калужско-Рижская', hex: '#F07025' },
        stations: [
            { name: 'Медведково', latlon: [55.8875998, 37.6613918] },
            {
                name: 'Бабушкинская',
                latlon: [55.8704204, 37.665132]
            },
            { name: 'Свиблово', latlon: [55.8556084, 37.6544465] },
            {
                name: 'Ботанический сад',
                latlon: [55.8459435, 37.6385031]
            },
            { name: 'ВДНХ', latlon: [55.821061, 37.641478] },
            {
                name: 'Алексеевская',
                latlon: [55.807779, 37.638693]
            },
            { name: 'Рижская', latlon: [55.792496, 37.636151] },
            {
                name: 'Проспект Мира',
                latlon: [55.7797015, 37.6336099]
            },
            { name: 'Сухаревская', latlon: [55.7723688, 37.6316918] },
            {
                name: 'Тургеневская',
                latlon: [55.76584, 37.636773]
            },
            { name: 'Китай-город', latlon: [55.7539316, 37.6348886] },
            {
                name: 'Третьяковская',
                latlon: [55.7407293, 37.6255854]
            },
            { name: 'Октябрьская', latlon: [55.7292498, 37.6113133] },
            {
                name: 'Шаболовская',
                latlon: [55.718815, 37.6081149]
            },
            { name: 'Ленинский проспект', latlon: [55.7117033, 37.5814546] },
            {
                name: 'Академическая',
                latlon: [55.687911, 37.573532]
            },
            { name: 'Профсоюзная', latlon: [55.677987, 37.562873] },
            {
                name: 'Новые Черёмушки',
                latlon: [55.670385, 37.554719]
            },
            { name: 'Калужская', latlon: [55.657167, 37.540428] },
            {
                name: 'Беляево',
                latlon: [55.642603, 37.526448]
            },
            { name: 'Коньково', latlon: [55.6346554, 37.5195901] },
            {
                name: 'Тёплый стан',
                latlon: [55.6205011, 37.505881]
            },
            { name: 'Ясенево', latlon: [55.6061825, 37.5349539] },
            {
                name: 'Новоясеневская',
                latlon: [55.6019545, 37.5529046]
            }
        ]
    },
    {
        line: { id: 7, name: 'Таганско-Краснопресненская', hex: '#89339E' },
        stations: [
            { name: 'Планерная', latlon: [55.860731, 37.43646] },
            {
                name: 'Сходненская',
                latlon: [55.850657, 37.43984]
            },
            { name: 'Тушинская', latlon: [55.8267074, 37.4375261] },
            {
                name: 'Спартак',
                latlon: [55.817478, 37.436128]
            },
            { name: 'Щукинская', latlon: [55.8076908, 37.4655764] },
            {
                name: 'Октябрьское поле',
                latlon: [55.79352, 37.493538]
            },
            { name: 'Полежаевская', latlon: [55.777524, 37.519501] },
            {
                name: 'Беговая',
                latlon: [55.773661, 37.546758]
            },
            { name: 'Улица 1905 года', latlon: [55.764703, 37.561451] },
            {
                name: 'Баррикадная',
                latlon: [55.760782, 37.581284]
            },
            { name: 'Пушкинская', latlon: [55.764955, 37.605906] },
            {
                name: 'Кузнецкий мост',
                latlon: [55.761548, 37.624413]
            },
            { name: 'Китай-город', latlon: [55.7539316, 37.6348886] },
            {
                name: 'Таганская',
                latlon: [55.7424507, 37.6533745]
            },
            { name: 'Пролетарская', latlon: [55.731711, 37.666369] },
            {
                name: 'Волгоградский проспект',
                latlon: [55.7259999, 37.68693]
            },
            { name: 'Текстильщики', latlon: [55.708956, 37.731283] },
            {
                name: 'Кузьминки',
                latlon: [55.7054024, 37.7656694]
            },
            { name: 'Рязанский проспект', latlon: [55.716922, 37.79328] },
            {
                name: 'Выхино',
                latlon: [55.71565, 37.817908]
            },
            { name: 'Лермонтовский проспект', latlon: [55.702222, 37.851881] },
            {
                name: 'Жулебино',
                latlon: [55.6844693, 37.8552019]
            },
            { name: 'Котельники', latlon: [55.6746193, 37.8575975] }
        ]
    },
    {
        line: { id: 8, name: 'Калининско-Солнцевская', hex: '#FBC81E' },
        stations: [
            { name: 'Новокосино', latlon: [55.745106, 37.8640159] },
            {
                name: 'Новогиреево',
                latlon: [55.751699, 37.816642]
            },
            { name: 'Перово', latlon: [55.75118999999999, 37.786649] },
            {
                name: 'Шоссе Энтузиастов',
                latlon: [55.758303, 37.751523]
            },
            { name: 'Авиамоторная', latlon: [55.751619, 37.717218] },
            {
                name: 'Площадь Ильича',
                latlon: [55.747297, 37.6807531]
            },
            { name: 'Марксистская', latlon: [55.74108889999999, 37.6566532] },
            {
                name: 'Третьяковская',
                latlon: [55.7407293, 37.6255854]
            },
            { name: 'Савёловская', latlon: [55.792807, 37.586122] },
            {
                name: 'Петровский парк',
                latlon: [55.791957, 37.557322]
            },
            { name: 'ЦСКА', latlon: [55.786602, 37.533301] },
            {
                name: 'Хорошёвская',
                latlon: [55.776862, 37.520797]
            },
            { name: 'Шелепиха', latlon: [55.757116, 37.524067] },
            {
                name: 'Деловой центр',
                latlon: [55.750015, 37.542048]
            },
            { name: 'Парк победы', latlon: [55.7358848, 37.5174924] },
            {
                name: 'Минская',
                latlon: [55.723947, 37.497872]
            },
            { name: 'Ломоносовский проспект', latlon: [55.70706, 37.516063] },
            {
                name: 'Раменки',
                latlon: [55.697691, 37.498725]
            },
            { name: 'Мичуринский проспект', latlon: [55.689456, 37.482969] },
            {
                name: 'Озёрная',
                latlon: [55.670574, 37.449003]
            },
            { name: 'Говорово', latlon: [55.659551, 37.417266] },
            {
                name: 'Солнцево',
                latlon: [55.649383, 37.3909]
            },
            { name: 'Боровское шоссе', latlon: [55.647671, 37.370122] },
            {
                name: 'Новопеределкино',
                latlon: [55.639613, 37.355228]
            },
            { name: 'Рассказовка', latlon: [55.633968, 37.334747] }
        ]
    },
    {
        line: { id: 9, name: 'Серпуховско-Тимирязевская', hex: '#9F9F9F' },
        stations: [
            { name: 'Алтуфьево', latlon: [55.897864, 37.587082] },
            {
                name: 'Бибирево',
                latlon: [55.8837138, 37.6047798]
            },
            { name: 'Отрадное', latlon: [55.863397, 37.604619] },
            {
                name: 'Владыкино',
                latlon: [55.8460423, 37.5893195]
            },
            { name: 'Петровско-Разумовская', latlon: [55.836661, 37.57535] },
            {
                name: 'Тимирязевская',
                latlon: [55.819012, 37.578891]
            },
            { name: 'Дмитровская', latlon: [55.8080834, 37.5813504] },
            {
                name: 'Савёловская',
                latlon: [55.7942914, 37.5881988]
            },
            { name: 'Менделеевская', latlon: [55.78174, 37.598943] },
            {
                name: 'Цветной бульвар',
                latlon: [55.771682, 37.620685]
            },
            { name: 'Чеховская', latlon: [55.7659327, 37.6078576] },
            {
                name: 'Боровицкая',
                latlon: [55.7503444, 37.6088658]
            },
            { name: 'Полянка', latlon: [55.73683, 37.6186425] },
            {
                name: 'Серпуховская',
                latlon: [55.726866, 37.6257733]
            },
            { name: 'Тульская', latlon: [55.708677, 37.622423] },
            {
                name: 'Нагатинская',
                latlon: [55.6830029, 37.621758]
            },
            { name: 'Нагорная', latlon: [55.6728846, 37.610313] },
            {
                name: 'Нахимовский проспект',
                latlon: [55.662596, 37.605321]
            },
            { name: 'Севастопольская', latlon: [55.651466, 37.5981134] },
            {
                name: 'Чертановская',
                latlon: [55.640833, 37.606228]
            },
            { name: 'Южная', latlon: [55.6234635, 37.6087977] },
            {
                name: 'Пражская',
                latlon: [55.612321, 37.604173]
            },
            { name: 'Улица академика Янгеля', latlon: [55.595155, 37.601373] },
            {
                name: 'Аннино',
                latlon: [55.583643, 37.596829]
            },
            { name: 'Бульвар Дмитрия Донского', latlon: [55.569497, 37.576439] }
        ]
    },
    {
        line: { id: 10, name: 'Люблинско-Дмитровская', hex: '#A8D92D' },
        stations: [
            { name: 'Селигерская', latlon: [55.866556, 37.547117] },
            {
                name: 'Верхние Лихоборы',
                latlon: [55.855143, 37.561589]
            },
            { name: 'Окружная', latlon: [55.844748, 37.575531] },
            {
                name: 'Петровско-Разумовская',
                latlon: [55.835392, 37.573762]
            },
            { name: 'Фонвизинская', latlon: [55.822888, 37.587344] },
            {
                name: 'Бутырская',
                latlon: [55.813531, 37.602247]
            },
            { name: 'Марьина роща', latlon: [55.7935432, 37.6168464] },
            {
                name: 'Достоевская',
                latlon: [55.7817338, 37.614065]
            },
            { name: 'Трубная', latlon: [55.767798, 37.621908] },
            {
                name: 'Сретенский бульвар',
                latlon: [55.765802, 37.639251]
            },
            { name: 'Чкаловская', latlon: [55.7560807, 37.6593866] },
            {
                name: 'Римская',
                latlon: [55.7468006, 37.6795593]
            },
            { name: 'Крестьянская застава', latlon: [55.7322759, 37.665521] },
            {
                name: 'Дубровка',
                latlon: [55.717828, 37.676631]
            },
            { name: 'Кожуховская', latlon: [55.706289, 37.685595] },
            {
                name: 'Печатники',
                latlon: [55.693163, 37.726901]
            },
            { name: 'Волжская', latlon: [55.690904, 37.75332] },
            {
                name: 'Люблино',
                latlon: [55.67568, 37.761759]
            },
            { name: 'Братиславская', latlon: [55.6590248, 37.7497575] },
            {
                name: 'Марьино',
                latlon: [55.650167, 37.743734]
            },
            { name: 'Борисово', latlon: [55.6334629, 37.744072] },
            {
                name: 'Шипиловская',
                latlon: [55.6202081, 37.7432181]
            },
            { name: 'Зябликово', latlon: [55.612031, 37.744946] }
        ]
    },
    {
        line: { id: 11, name: 'Большая кольцевая линия', hex: '#de64a1' },
        stations: [
            { name: 'Деловой центр', latlon: [55.749025, 37.539904] },
            {
                name: 'Шелепиха',
                latlon: [55.757116, 37.524067]
            },
            { name: 'Хорошёвская', latlon: [55.776862, 37.520797] },
            {
                name: 'ЦСКА',
                latlon: [55.786602, 37.533301]
            },
            { name: 'Петровский парк', latlon: [55.791957, 37.557322] },
            {
                name: 'Савёловская',
                latlon: [55.792807, 37.586122]
            }
        ]
    },
    {
        line: { id: 12, name: 'Бутовская', hex: '#B0BFE7' },
        stations: [
            { name: 'Битцевский парк', latlon: [55.600761, 37.555577] },
            {
                name: 'Лесопарковая',
                latlon: [55.581433, 37.579106]
            },
            { name: 'Улица Старокачаловская', latlon: [55.569341, 37.576515] },
            {
                name: 'Улица Скобелевская',
                latlon: [55.548141, 37.55466]
            },
            { name: 'Бульвар адмирала Ушакова', latlon: [55.54516899999999, 37.54229] },
            {
                name: 'Улица Горчакова',
                latlon: [55.542106, 37.531716]
            },
            { name: 'Бунинская аллея', latlon: [55.537949, 37.515382] }
        ]
    },
    {
        line: { id: 13, name: 'Московский монорельс', hex: '#9999ff' },
        stations: [
            { name: 'Тимирязевская', latlon: [55.819012, 37.578891] },
            {
                name: 'Улица Милашенкова',
                latlon: [55.8217654, 37.5891812]
            },
            { name: 'Телецентр', latlon: [55.821818, 37.608926] },
            {
                name: 'Улица Академика Королёва',
                latlon: [55.821061, 37.641478]
            },
            { name: 'Выставочный центр', latlon: [55.824049, 37.638473] },
            {
                name: 'Улица Сергея Эйзенштейна',
                latlon: [55.8292094, 37.644801]
            }
        ]
    }
];
const SPB: Array<Metro> = [
    {
        line: { id: 1, name: 'Кировско-Выборгская', hex: '#c6333c' },
        stations: [
            { name: 'Девяткино', latlon: [60.050251, 30.442809] },
            {
                name: 'Гражданский проспект',
                latlon: [60.034915, 30.418276]
            },
            { name: 'Академическая', latlon: [60.012719, 30.396133] },
            {
                name: 'Политехническая',
                latlon: [60.008815, 30.370908]
            },
            { name: 'Площадь Мужества', latlon: [59.999615, 30.366497] },
            {
                name: 'Лесная',
                latlon: [59.984769, 30.344354]
            },
            { name: 'Выборгская', latlon: [59.971024, 30.347345] },
            {
                name: 'Площадь Ленина',
                latlon: [59.955723, 30.356014]
            },
            { name: 'Чернышевская', latlon: [59.944436, 30.359975] },
            {
                name: 'Площадь Восстания',
                latlon: [59.931517, 30.360559]
            },
            { name: 'Владимирская', latlon: [59.927455, 30.348225] },
            {
                name: 'Пушкинская',
                latlon: [59.920614, 30.329864]
            },
            { name: 'Технологический институт – 1', latlon: [59.916342, 30.318545] },
            {
                name: 'Балтийская',
                latlon: [59.907135, 30.299519]
            },
            { name: 'Нарвская', latlon: [59.901111, 30.275004] },
            {
                name: 'Кировский завод',
                latlon: [59.879638, 30.26196]
            },
            { name: 'Автово', latlon: [59.867308, 30.261403] },
            {
                name: 'Ленинский проспект',
                latlon: [59.851774, 30.268428]
            },
            { name: 'Проспект Ветеранов', latlon: [59.84211, 30.250588] }
        ]
    },
    {
        line: { id: 2, name: 'Московско-Петроградская', hex: '#3c81c3' },
        stations: [
            { name: 'Парнас', latlon: [60.066971, 30.333996] },
            {
                name: 'Проспект Просвещения',
                latlon: [60.05141, 30.332541]
            },
            { name: 'Озерки', latlon: [60.037131, 30.321878] },
            {
                name: 'Удельная',
                latlon: [60.016721, 30.315886]
            },
            { name: 'Пионерская', latlon: [60.002517, 30.296662] },
            {
                name: 'Чёрная речка',
                latlon: [59.985512, 30.30083]
            },
            { name: 'Петроградская', latlon: [59.966498, 30.31143] },
            {
                name: 'Горьковская',
                latlon: [59.956147, 30.318833]
            },
            { name: 'Невский проспект', latlon: [59.935579, 30.327025] },
            {
                name: 'Сенная площадь',
                latlon: [59.926972, 30.320458]
            },
            { name: 'Технологический институт – 2', latlon: [59.9166, 30.318779] },
            {
                name: 'Фрунзенская',
                latlon: [59.906179, 30.31753]
            },
            { name: 'Московские ворота', latlon: [59.891494, 30.31797] },
            {
                name: 'Электросила',
                latlon: [59.879164, 30.318716]
            },
            { name: 'Парк Победы', latlon: [59.866269, 30.321887] },
            {
                name: 'Московская',
                latlon: [59.848873, 30.321483]
            },
            { name: 'Звёздная', latlon: [59.833154, 30.349321] },
            {
                name: 'Купчино',
                latlon: [59.829328, 30.375588]
            }
        ]
    },
    {
        line: { id: 3, name: 'Невско-Василеостровская', hex: '#42935d' },
        stations: [
            { name: 'Беговая', latlon: [59.98778, 30.202501] },
            {
                name: 'Новокрестовская',
                latlon: [59.971879, 30.211942]
            },
            { name: 'Приморская', latlon: [59.948456, 30.234633] },
            {
                name: 'Василеостровская',
                latlon: [59.942525, 30.278247]
            },
            { name: 'Гостиный двор', latlon: [59.933947, 30.333664] },
            {
                name: 'Маяковская',
                latlon: [59.931413, 30.355232]
            },
            { name: 'Площадь Александра Невского – 1', latlon: [59.924285, 30.385218] },
            {
                name: 'Елизаровская',
                latlon: [59.896644, 30.423774]
            },
            { name: 'Ломоносовская', latlon: [59.877253, 30.441812] },
            {
                name: 'Пролетарская',
                latlon: [59.865122, 30.470315]
            },
            { name: 'Обухово', latlon: [59.84861, 30.457811] },
            { name: 'Рыбацкое', latlon: [59.830911, 30.500391] }
        ]
    },
    {
        line: { id: 4, name: 'Правобережная', hex: '#cf752d' },
        stations: [
            { name: 'Спасская', latlon: [59.926575, 30.319839] },
            {
                name: 'Достоевская',
                latlon: [59.928185, 30.346204]
            },
            { name: 'Лиговский проспект', latlon: [59.920745, 30.35516] },
            {
                name: 'Площадь Александра Невского',
                latlon: [59.923563, 30.383421]
            },
            { name: 'Новочеркасская', latlon: [59.929078, 30.412859] },
            {
                name: 'Ладожская',
                latlon: [59.932495, 30.439306]
            },
            { name: 'Проспект Большевиков', latlon: [59.919874, 30.466803] },
            {
                name: 'Улица Дыбенко',
                latlon: [59.907437, 30.483359]
            }
        ]
    },
    {
        line: { id: 5, name: 'Фрунзенско-Приморская', hex: '#631872' },
        stations: [
            { name: 'Комендантский проспект', latlon: [60.008549, 30.258663] },
            {
                name: 'Старая Деревня',
                latlon: [59.989342, 30.255169]
            },
            { name: 'Крестовский остров', latlon: [59.971794, 30.259373] },
            {
                name: 'Чкаловская',
                latlon: [59.960985, 30.292099]
            },
            { name: 'Спортивная', latlon: [59.950222, 30.288317] },
            {
                name: 'Адмиралтейская',
                latlon: [59.935985, 30.315078]
            },
            { name: 'Садовая', latlon: [59.926476, 30.318213] },
            {
                name: 'Звенигородская',
                latlon: [59.922282, 30.335631]
            },
            { name: 'Обводный канал', latlon: [59.914669, 30.349573] },
            {
                name: 'Волковская',
                latlon: [59.895971, 30.358026]
            },
            { name: 'Бухарестская', latlon: [59.883738, 30.368985] },
            {
                name: 'Международная',
                latlon: [59.870203, 30.379289]
            }
        ]
    }
];

export { MOSCOW, SPB };
